Marylebone/Marylabone_mesh/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
omegaInlet 22.4;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
  boundaryField
  {
      inlet
      {
         type            atmBoundaryLayerInletOmega;
         flowDir              (1 0 0);
         zDir               (0 0 1);
         Uref            0.7287;
         Zref            557;
         z0              uniform 0.1;
         zGround         uniform 0.0;
         value           uniform $omegaInlet;
     }


      outlet
      {
          type            inletOutlet;
          inletValue      uniform $omegaInlet;
          value           uniform $omegaInlet;
      }

      wall
      {
          type            omegaWallFunction;
          value           uniform $omegaInlet;
      }

      #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
